bench-results-fixed/logs/bench-ft-a2av-decode-20260723-082603.log
Writing benchmark result to bench-results-fixed/ft-a2av-decode-20260723-085859.json
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff8b17305e0>, trust_remote_code=False, seed=0, num_prompts=1024, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=256, model='deepseek-ai/DeepSeek-V2-Lite-Chat', input_len=128, output_len=1024, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=128, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['config=ft-a2av', 'workload=decode', 'tp=1', 'dp=8', 'model=deepseek-ai/DeepSeek-V2-Lite-Chat', 'dtype=bfloat16', 'max_model_len=4096', 'max_num_batched_tokens=4096', 'all2all_backend=ft_nccl_ep'], result_dir='bench-results-fixed', result_filename='ft-a2av-decode-20260723-085859.json', ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-dc9702a2-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=1800, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-23 08:59:09 [utils.py:90] Sampling input_len from [128, 128] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Waiting for endpoint to become up in 1800 seconds
 |          | 00:00 elapsed, 00:28 remainingWARNING 07-23 08:59:10 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:05 elapsed, 29:54 remainingWARNING 07-23 08:59:15 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:10 elapsed, 29:49 remainingWARNING 07-23 08:59:20 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:15 elapsed, 29:44 remainingWARNING 07-23 08:59:25 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:20 elapsed, 29:39 remainingWARNING 07-23 08:59:30 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:25 elapsed, 29:34 remainingWARNING 07-23 08:59:35 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:30 elapsed, 29:29 remainingWARNING 07-23 08:59:40 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:35 elapsed, 29:24 remainingWARNING 07-23 08:59:45 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:40 elapsed, 29:19 remainingWARNING 07-23 08:59:50 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 00:45 elapsed, 29:14 remainingWARNING 07-23 08:59:55 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 00:50 elapsed, 29:09 remainingWARNING 07-23 09:00:00 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 00:55 elapsed, 29:04 remainingWARNING 07-23 09:00:05 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 01:00 elapsed, 28:59 remainingWARNING 07-23 09:00:10 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 01:05 elapsed, 28:54 remainingWARNING 07-23 09:00:15 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:10 elapsed, 28:49 remainingWARNING 07-23 09:00:20 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:15 elapsed, 28:44 remainingWARNING 07-23 09:00:25 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:20 elapsed, 28:39 remainingWARNING 07-23 09:00:30 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:25 elapsed, 28:34 remainingWARNING 07-23 09:00:35 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:30 elapsed, 28:29 remainingWARNING 07-23 09:00:40 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:35 elapsed, 28:24 remainingWARNING 07-23 09:00:45 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:40 elapsed, 28:19 remainingWARNING 07-23 09:00:50 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:45 elapsed, 28:14 remainingWARNING 07-23 09:00:55 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:50 elapsed, 28:09 remainingWARNING 07-23 09:01:00 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▋         | 01:55 elapsed, 28:04 remainingWARNING 07-23 09:01:05 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▋         | 02:00 elapsed, 27:59 remainingWARNING 07-23 09:01:10 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▋         | 02:13 elapsed, 29:54 remaining
Initial test run completed.
Warming up with 128 requests...
100%|██████████| 128/128 [00:20<00:00,  6.19it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 256
100%|██████████| 1024/1024 [02:13<00:00,  7.68it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1024      
Failed requests:                         0         
Maximum request concurrency:             256       
Benchmark duration (s):                  133.29    
Total input tokens:                      131072    
Total generated tokens:                  1048576   
Request throughput (req/s):              7.68      
Output token throughput (tok/s):         7866.84   
Peak output token throughput (tok/s):    13824.00  
Peak concurrent requests:                512.00    
Total token throughput (tok/s):          8850.20   
---------------Time to First Token----------------
Mean TTFT (ms):                          1150.05   
Median TTFT (ms):                        1277.83   
P99 TTFT (ms):                           1569.07   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.43     
Median TPOT (ms):                        31.72     
P99 TPOT (ms):                           32.91     
---------------Inter-token Latency----------------
Mean ITL (ms):                           31.43     
Median ITL (ms):                         31.09     
P99 ITL (ms):                            45.05     
==================================================